___
# Data Manipulation: Basics

## Removing duplicated data
___

### Importing libraries and Classes

In [1]:
import numpy as np
import pandas as pd

from pandas import DataFrame

In [2]:
data = {
    'column 1': [1,1,2,2,3,3,3],
    'column 2': ['a','a','b','b','c','c','c'],
    'column 3': ['A','A','B','B','C','C','C']   
}

df = DataFrame(data)
df

   column 1 column 2 column 3
0         1        a        A
1         1        a        A
2         2        b        B
3         2        b        B
4         3        c        C
5         3        c        C
6         3        c        C

### Removing duplicated data

object_name.duplicated()

In [3]:
df.duplicated()

0    False
1     True
2    False
3     True
4    False
5     True
6     True
dtype: bool

object_name.drop_duplicates()

In [4]:
df.drop_duplicates()

   column 1 column 2 column 3
0         1        a        A
2         2        b        B
4         3        c        C

In [5]:
df

   column 1 column 2 column 3
0         1        a        A
1         1        a        A
2         2        b        B
3         2        b        B
4         3        c        C
5         3        c        C
6         3        c        C

##### Remove duplicates in DataFrame
object_name.drop_duplicates(inplace=True)

In [6]:
df.drop_duplicates(inplace=True)
df

   column 1 column 2 column 3
0         1        a        A
2         2        b        B
4         3        c        C

##### Remove duplicates in DataFrame consider columns
object_name.drop_duplicates(['column name'])

In [10]:
data = {
    'column 1': [1,1,2,2,3,3,3],
    'column 2': ['a','a','b','b','c','c','c'],
    'column 3': ['D','A','B','B','C','C','C']   
}

df = DataFrame(data)
df

   column 1 column 2 column 3
0         1        a        D
1         1        a        A
2         2        b        B
3         2        b        B
4         3        c        C
5         3        c        C
6         3        c        C

In [11]:
df.drop_duplicates(['column 3'])

   column 1 column 2 column 3
0         1        a        D
1         1        a        A
2         2        b        B
4         3        c        C